VPro/src/Documents/Event/Event.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Event</name>
  <basedOn>Document.Event</basedOn>
  <basedOn>Document.WorkOrder</basedOn>
  <basedOn>Document.CustomerOrder</basedOn>
  <basedOn>Document.PurchaseOrder</basedOn>
  <basedOn>Document.SupplierInvoice</basedOn>
  <basedOn>Document.CustomerInvoice</basedOn>
  <basedOn>Document.InvoiceForPayment</basedOn>
  <basedOn>Document.PaymentExpense</basedOn>
  <basedOn>Document.CashPayment</basedOn>
  <basedOn>Document.PaymentOrder</basedOn>
  <basedOn>Document.PaymentReceipt</basedOn>
  <basedOn>Document.CashReceipt</basedOn>
  <basedOn>Document.AgentReport</basedOn>
  <basedOn>Document.ReportToPrincipal</basedOn>
  <basedOn>Document.ProcessingReport</basedOn>
  <basedOn>Document.SubcontractorReport</basedOn>
  <basedOn>Document.AcceptanceCertificate</basedOn>
  <basedOn>Catalog.Counterparties</basedOn>
  <basedOn>Catalog.ContactPersons</basedOn>
  <basedOn>Document.SupplierInvoiceForPayment</basedOn>
  <basedOn>Document.SettlementsReconciliation</basedOn>
  <basedOn>Document.ProductionOrder</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ScheduleLoadingResources</registerRecords>
  <attributes>
    <name>EventType</name>
    <type>
      <types>EnumRef.EventTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>State</name>
    <type>
      <types>CatalogRef.EventStates</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomingOutgoingEvent</name>
    <type>
      <types>EnumRef.IncomingOutgoingEvent</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <types>CatalogRef.EventsSubjects</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContentHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ImagesHTML</name>
    <comment>The structure of pictures of the formatted document</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.CustomerInvoice</types>
      <types>DocumentRef.AgentReport</types>
      <types>DocumentRef.SettlementsReconciliation</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.WorkOrder</types>
      <types>DocumentRef.AcceptanceCertificate</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.ProcessingReport</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.CustomerOrder</types>
      <types>DocumentRef.ProductionOrder</types>
      <types>DocumentRef.InvoiceForPayment</types>
      <types>DocumentRef.Event</types>
      <types>DocumentRef.SubcontractorReport</types>
      <types>DocumentRef.PaymentOrder</types>
      <types>DocumentRef.ReportToPrincipal</types>
      <types>DocumentRef.CashPayment</types>
      <types>DocumentRef.PurchaseOrder</types>
      <types>DocumentRef.BulkMail</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.SupplierInvoiceForPayment</types>
    </type>
  </attributes>
  <attributes>
    <name>EventBegin</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EventEnding</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>ParticipantsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>UserAccount</name>
    <type>
      <types>CatalogRef.EmailAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSSenderName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EmployeeCalendar</name>
    <type>
      <types>CatalogRef.EmployeesCalendars</types>
    </type>
  </attributes>
  <tabularSections>
    <name>BasisDocuments</name>
    <attributes>
      <name>BasisDocument</name>
      <type>
        <types>DocumentRef.CustomerInvoice</types>
        <types>DocumentRef.AgentReport</types>
        <types>DocumentRef.SettlementsReconciliation</types>
        <types>DocumentRef.SupplierInvoice</types>
        <types>DocumentRef.WorkOrder</types>
        <types>DocumentRef.AcceptanceCertificate</types>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.ProcessingReport</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.CustomerOrder</types>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.InvoiceForPayment</types>
        <types>DocumentRef.Event</types>
        <types>DocumentRef.SubcontractorReport</types>
        <types>DocumentRef.PaymentOrder</types>
        <types>DocumentRef.ReportToPrincipal</types>
        <types>DocumentRef.CashPayment</types>
        <types>DocumentRef.PurchaseOrder</types>
        <types>DocumentRef.BulkMail</types>
        <types>DocumentRef.PaymentReceipt</types>
        <types>DocumentRef.SupplierInvoiceForPayment</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Participants</name>
    <attributes>
      <name>Contact</name>
      <type>
        <types>CatalogRef.ContactPersons</types>
        <types>String</types>
        <types>CatalogRef.Counterparties</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HowToContact</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NumberForSending</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MessageID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryStatus</name>
      <type>
        <types>EnumRef.SMSMessageStates</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EnterpriseResources</name>
    <attributes>
      <name>EnterpriseResource</name>
      <type>
        <types>CatalogRef.KeyResources</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Start</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Finish</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Mon</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Tu</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>We</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Th</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Fr</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Sa</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Su</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>RepeatInterval</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CompleteAfter</name>
      <type>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CompleteKind</name>
      <type>
        <types>EnumRef.ScheduleRepeatCompletingKind</types>
      </type>
    </attributes>
    <attributes>
      <name>RepeatKind</name>
      <type>
        <types>EnumRef.ScheduleRepeatKind</types>
      </type>
    </attributes>
    <attributes>
      <name>RepeatabilityDate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>LastMonthDay</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>WeekDayMonth</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WeekMonthNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MonthNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/Enums/EventTypes/EventTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EventTypes</name>
  <enumValues>
    <name>PhoneCall</name>
  </enumValues>
  <enumValues>
    <name>PersonalMeeting</name>
  </enumValues>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>SMS</name>
  </enumValues>
  <enumValues>
    <name>Record</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/ContactInformationTypes/ContactInformationTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ContactInformationTypes</name>
  <enumValues>
    <name>Address</name>
  </enumValues>
  <enumValues>
    <name>Phone</name>
  </enumValues>
  <enumValues>
    <name>EmailAddress</name>
  </enumValues>
  <enumValues>
    <name>WebPage</name>
  </enumValues>
  <enumValues>
    <name>Fax</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Documents/Event/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure PresentationFieldsReceiveDataProcessor(Fields, StandardProcessing)
	
	StandardProcessing = False;
	
	Fields.Add("Date");
	Fields.Add("EventType");
	
EndProcedure

Procedure PresentationReceiveDataProcessor(Data, Presentation, StandardProcessing)
	
	StandardProcessing = False;
	
	Presentation = NStr("en='Event: ';vi='Sự kiện: ';") + Data.EventType + NStr("en=' dated ';vi='  '") + Format(Data.Date, "DF=dd.MM.yyyy");
	
EndProcedure

Procedure FormGetProcessing(FormKind, Parameters, SelectedForm, AdditionalInformation, StandardProcessing)
	
	If FormKind <> "DocumentForm"
		AND FormKind <> "ObjectForm" Then
		Return;
	EndIf;
	
	EventType = Undefined; 
	
	If Parameters.Property("Key") AND ValueIsFilled(Parameters.Key) Then
		EventType	= CommonUse.ObjectAttributeValue(Parameters.Key, "EventType");
	EndIf;
	
	// If the document is copied that we get event type from copied document.
	If Not ValueIsFilled(EventType) Then
		If Parameters.Property("CopyingValue")
			AND ValueIsFilled(Parameters.CopyingValue) Then
			EventType = CommonUse.ObjectAttributeValue(Parameters.CopyingValue, "EventType");
		EndIf;
	EndIf;
	
	If Not ValueIsFilled(EventType) Then
		If Parameters.Property("FillingValues") 
			AND TypeOf(Parameters.FillingValues) = Type("Structure") Then
			If Parameters.FillingValues.Property("EventType") Then
				EventType	= Parameters.FillingValues.EventType;
			EndIf;
		EndIf;
	EndIf;
	
	StandardProcessing = False;
	EventForms = GetOperationKindMapToForms();
	SelectedForm = EventForms[EventType];
	If SelectedForm = Undefined Then
		SelectedForm = "DocumentForm";
	EndIf;

EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

Function GetOperationKindMapToForms() Export

	EventForms = New Map;
	EventForms.Insert(Enums.EventTypes.Email, 			"EmailForm");
	EventForms.Insert(Enums.EventTypes.SMS,				"MessagesSMSForm");
	EventForms.Insert(Enums.EventTypes.PhoneCall,		"EventForm");
	EventForms.Insert(Enums.EventTypes.PersonalMeeting,	"EventForm");
	EventForms.Insert(Enums.EventTypes.Other,			"EventForm");
	EventForms.Insert(Enums.EventTypes.Record,			"FormEventCounterpartyRecord");
	
	Return EventForms;

EndFunction 

#EndRegion

#Region PrintInterface

// Fills in the list of printing commands.
// 
// Parameters:
//   PrintCommands - ValueTable - see fields' content in the PrintManagement.CreatePrintCommandsCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
	
	
	
EndProcedure

#EndRegion

#Region Interface

Function GetHowToContact(Contact, IsEmail = False) Export
	
	Result = "";
	
	Contacts = New Array;
	Contacts.Add(Contact);
	
	TypesCI = New Array;
	TypesCI.Add(Enums.ContactInformationTypes.EmailAddress);
	If Not IsEmail Then
		TypesCI.Add(Enums.ContactInformationTypes.Phone);
	EndIf;
	
	TableCI = ContactInformationManagement.ObjectsContactInformation(Contacts, TypesCI);
	TableCI.Sort("Type DESC");
	For Each RowCI In TableCI Do
		Result = "" + Result + ?(Result = "", "", ", ") + RowCI.Presentation;
	EndDo;
	
	Return Result;
	
EndFunction

#EndRegion

#Region EmailSB

Function SubjectWithResponsePrefix(Subject, Command) Export
	
	If Command = EmailSBClientServer.CommandReply() Then
		
		If StrStartWith(Upper(Subject), "RE:") Then
			Return Subject;
		EndIf;
		
		Return StrTemplate("Re: %1", Subject);
		
	ElsIf Command = EmailSBClientServer.CommandForward() Then
		
		If StrStartWith(Upper(Subject), "Fw:") Then
			Return Subject;
		EndIf;
		
		Return StrTemplate("Fw: %1", Subject);
		
	Else
		
		Return Subject;
		
	EndIf;
	
EndFunction
	
#EndRegion

#Region WorkWithCalendar

// Функция определяет пиктограмму для элемента записи календаря
//
// Параметры:
//  Событие	 - ДокументСсылка.Событие	 - событие, для записи календаря которого подбирается картинка
// 
// Возвращаемое значение:
//  Картинка - пиктограмма записи календаря
//
Function CalendarRecordPicture(Event) Экспорт
	
	EventType = CommonUse.ObjectAttributeValue(Event, "EventType");
	СоответствиеТиповКартинкам = MapEventTypesPictures();
	Picture = СоответствиеТиповКартинкам[EventType];
	If Picture = Undefined Then
		Picture = New Picture;
	EndIf;
	
	Return Picture;
	
EndFunction

// Функция определяет цвет текста для элемента записи календаря
//
// Параметры:
//  Событие	 - ДокументСсылка.Событие	 - событие, для записи календаря которого подбирается цвет
// 
// Возвращаемое значение:
//  Цвет - цвет текста записи календаря
//
Function CalendarRecorTextColor(Event) Export
	
	StateColor = Event.State.Color.Get();
	If StateColor = Undefined Then
		StateColor = New Color;
	EndIf;
	
	Return StateColor;
	
EndFunction

// Процедура заполняет таблицу описаний расширенного ввода записи календаря
//
// Параметры:
//  ТаблицаОписаний	 - ТаблицаЗначений	 - описание колонок см. Справочник.ЗаписиКалендаряСотрудника.ПриЗаполненииРасширенногоВводаЗаписиКалендаря()
//
Процедура OnFillingExtendedInputCalendarRecorder(DescriptionTable) Export
	
	NewRow = DescriptionTable.Add();
	NewRow.FormName = "Document.Event.Form.EventForm";
	NewRow.FormParameters = New Structure("FillValue", New Structure("EventType", Enums.EventTypes.PersonalMeeting));
	NewRow.Presentation = NStr("en='Event: Meeting';ru='Событие: Личная встреча';vi='Sự kiện: Họp'");
	
	NewRow = DescriptionTable.Add();
	NewRow.FormName = "Document.Event.Form.EventForm";
	NewRow.FormParameters = New Structure("FillValue", New Structure("EventType", Enums.EventTypes.PhoneCall));
	NewRow.Presentation = NStr("en='Event: Phone call';ru='Событие: Телефонный звонок';vi='Sự kiện: Cuộc gọi điện thoại'");
	
	NewRow = DescriptionTable.Add();
	NewRow.FormName = "Document.Event.Form.EventForm";
	NewRow.FormParameters = New Structure("FillValue", New Structure("EventType", Enums.EventTypes.Other));
	NewRow.Presentation = NStr("en='Event: Other';ru='Событие: Прочее';vi='Sự kiện: Khác'");
	
КонецПроцедуры

#EndRegion

Function MapEventTypesPictures() Export
	
	MapEventTypesPictures = New Map;
	MapEventTypesPictures.Вставить(Enums.EventTypes.PersonalMeeting, PictureLib.ContactInformationAddress);
	MapEventTypesPictures.Вставить(Enums.EventTypes.Other, PictureLib.ContactInformationOther);
	MapEventTypesPictures.Вставить(Enums.EventTypes.SMS, PictureLib.ContactInformationPhone);
	MapEventTypesPictures.Вставить(Enums.EventTypes.PhoneCall, PictureLib.ContactInformationPhone);
	MapEventTypesPictures.Вставить(Enums.EventTypes.Email, PictureLib.ContactInformationEmail);
	MapEventTypesPictures.Вставить(Enums.EventTypes.Record, PictureLib.ТипСобытияЗапись);
	
	Return MapEventTypesPictures;
	
EndFunction


#EndIf
